export const REQUEST_ACTIONS = [
  'ბინა',
  'სტაციონარი',
  'კვლევა'
];

export const STUDY_TYPE_OPTIONS = [
  'თავისა და თავის ტვინის CT',
  'გულმკერდის ღრუს ორგანოების CT კონტრასტით',
  'გულმკერდის ღრუს ორგანოების CT კონტრასტის გარეშე',
  'პოლიტრავმა',
  'თავისა და თავის ტვინის CT კონტრასტით',
  'თავის ტვინის MRI DWI რეჟიმში',
  'მუცლის ღრუს ორგანოების CT კონტრასტით',
  'მცირე მენჯის ღრუს ორგანოების CT კონტრასტით',
  'სახის ძვლების CT'
];

export const CONSENT_STATUSES = [
  'უარი სტაციონარზე',
  'უარი კატეზე',
  'უარი ოპერაციაზე',
  'უარი გაგრძელებაზე'
];

export const DEPARTMENTS = [
  'ანგიოქირურგია',
  'ანესთეზია',
  'ბავშვთა გადაუდებელი მედიცინა',
  'ბავშვთა ონკო-ჰემატოლოგია',
  'ბავშვთა რეანიმაცია',
  'ბავშვთა ქირურგია',
  'გადაუდებელი მედიცინა',
  'გინეკოლოგია',
  'ზოგადი რეანიმაცია',
  'ზოგადი ქირურგია',
  'თორაკო ქირურგია',
  'ინფექციური სნეულებები',
  'კარდიო რეანიმაცია',
  'კარდიოლოგია',
  'ნევროლოგია',
  'ნეირო რეანიმაცია',
  'ნეირო ქირურგია',
  'ნეფროლოგია',
  'პედიატრია',
  'პულმონოლოგია',
  'საოპერაციო',
  'ტრავმატოლოგია',
  'უროლოგია',
  'ყბა-სახის ქირურგია',
  'შინაგანი მედიცინა',
  'ჰემატოლოგია 10',
  'ჰემატოლოგია 3',
  'ჰეპატოლოგია',
  'ზრდასრულთა ემერჯენსი',
  'ქირურგია',
  'რეანიმაცია',
  'კარდიორეანიმაცია',
  'ბავშვთა ემერჯენსი',
  'ნეიროქირურგია',
  'თორაკოქირურგია',
  'ონკოჰემატოლოგია 1',
  'ონკოჰემატოლოგია 2'
];

export const REQUEST_STATUSES = [
  "ახალი",
  "განხილვაშია",
  "მიღებულია",
  "დადასტურებულია",
  "დასრულებულია",
  "უარყოფილია",
  "თანხმდება დაზღვევასთან"
];

export const FINAL_DECISIONS = [
  "პაციენტი გაუშვით ბინაზე",
  "პაციენტი შემოვიდეს რეგისტრატურაში",
  "პაციენტი რეგისტრატურაში არ შემოსულა",
  "პაციენტი დაწვეს კლინიკაში / სტაციონარში",
  "კვლევა ჩატარდეს",
  "კვლევა არ ჩატარდეს",
  "საჭიროებს დამატებით დაზუსტებას",
  "გაუქმებულია"
];
